 #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает цветовую индикацию статусов.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - список объектов и значений их реквизитов:
//   * Ключ - ПеречислениеСсылка.ПЗТ_СтатусыЗадачиПользователяТелеграм - Ссылка на элемент перечисления;
//   * Значение - Цвет - Цвет соответствующий статусу
//
Функция ЦветоваяИндикацияСтатусов() Экспорт
		
	Результат = Новый Соответствие;
	Результат.Вставить(Создана, ЦветаСтиля.ЦветТекстаПоля);
	Результат.Вставить(ВРаботе, ЦветаСтиля.ПЗТ_ЦветТекстаВРаботе);
	Результат.Вставить(Бэклог, ЦветаСтиля.ПЗТ_ЦветТекстаБэклог);
	Результат.Вставить(Выполнена, ЦветаСтиля.ПЗТ_ЦветТекстаВыполнена);
	Результат.Вставить(НеБудетВыполнена, ЦветаСтиля.ПЗТ_ЦветТекстаНеБудетВыполнена);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти	
	
#КонецЕсли
