 #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает цветовую индикацию статусов перечисления.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - список объектов и значений их реквизитов:
//   * Ключ - ПеречислениеСсылка.ПЗТ_СтатусыЗадачиПользователяТелеграм - Ссылка на элемент перечисления;
//   * Значение - Цвет - Цвет соответствующий статусу
//
Функция ЦветоваяИндикацияФонаПриоритетов() Экспорт
		
	Результат = Новый Соответствие;
	Результат.Вставить(Низкий, ЦветаСтиля.ЦветФонаПоля);
	Результат.Вставить(Средний, ЦветаСтиля.ЦветФонаПоля);
	Результат.Вставить(Высокий, ЦветаСтиля.ПЗТ_ЦветФонаВнимание);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти	
	
#КонецЕсли
