
#Область ПрограммныйИнтерфейс

&После("ПриОпределенииНастроекРегламентныхЗаданий")
Процедура ПЗТ_ПриОпределенииНастроекРегламентныхЗаданий(Настройки)
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ПЗТ_ЗагрузкаЗадачПользователейИзТелеграм;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	Настройка.ДоступноВМоделиСервиса = Ложь;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ПЗТ_ОтправкаОтветовПоЗадачамПользователейТелеграм;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	Настройка.ДоступноВМоделиСервиса = Ложь;

КонецПроцедуры

#КонецОбласти